In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:140139@localhost/sparkifydb

'Connected: postgres@sparkifydb'

In [5]:
%sql SELECT COUNT(*) FROM songplays;

 * postgresql://postgres:***@localhost/sparkifydb
1 rows affected.

[(1,)]

In [6]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://postgres:***@localhost/sparkifydb
5 rows affected.

[(61, 'Samuel', 'Gonzalez', 'M', 'free'),
 (50, 'Ava', 'Robinson', 'F', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free'),
 (88, 'Mohammad', 'Rodriguez', 'M', 'paid'),
 (56, 'Cienna', 'Freeman', 'F', 'free')]

In [7]:
%sql SELECT COUNT(*) FROM songs;

 * postgresql://postgres:***@localhost/sparkifydb
1 rows affected.

[(71,)]

In [8]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://postgres:***@localhost/sparkifydb
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', Decimal('NaN'), Decimal('NaN')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.14968'), Decimal('-90.04892')),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', Decimal('NaN'), Decimal('NaN')),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', Decimal('NaN'), Decimal('NaN')),
 ('ARXR32B1187FB57099', 'Gob', '', Decimal('NaN'), Decimal('NaN'))]

In [9]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://postgres:***@localhost/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 1, 21, 1, 46, 796000), 21, 1, 44, 11, 2018, 'Thursday'),
 (datetime.datetime(2018, 11, 1, 21, 5, 52, 796000), 21, 1, 44, 11, 2018, 'Thursday'),
 (datetime.datetime(2018, 11, 1, 21, 8, 16, 796000), 21, 1, 44, 11, 2018, 'Thursday'),
 (datetime.datetime(2018, 11, 1, 21, 11, 13, 796000), 21, 1, 44, 11, 2018, 'Thursday'),
 (datetime.datetime(2018, 11, 1, 21, 17, 33, 796000), 21, 1, 44, 11, 2018, 'Thursday')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [8]:
# %sql SELECT * FROM songs LEFT JOIN artists ON songs.artist_id=artists.artist_id